[
  {
    "title": "Reading Arabic",
    "description": "Before you can recite the Quran, you need to recognize Arabic letters and their sounds. This is the foundation everything else builds on.",
    "steps": [
      {
        "title": "Learn the Arabic Alphabet",
        "text": "There are 28 letters in Arabic. Each letter has up to 4 forms depending on its position in a word (isolated, initial, medial, final). Start by memorizing the isolated form of each letter and its sound. Practice daily for 10–15 minutes."
      },
      {
        "title": "Understand Short Vowels (Harakat)",
        "text": "Short vowels are written as small marks above or below letters. Fatha (َ) = 'a' sound, Kasra (ِ) = 'i' sound, Damma (ُ) = 'u' sound. Sukun (ْ) means no vowel — the letter is silent. Shadda (ّ) means the letter is doubled."
      },
      {
        "title": "Practice Letter Joining",
        "text": "Arabic is a cursive script — most letters connect to the next. Practice writing and reading connected letters. Start with 2-letter combinations, then 3-letter words. Use Noorani Qaida or a similar beginner guide."
      },
      {
        "title": "Read Short Surahs",
        "text": "Begin with the last Juz (Juz 'Amma) — Surahs Al-Ikhlas, Al-Falaq, An-Nas, Al-Kawthar. These are short, frequently repeated, and will help you get comfortable reading Arabic quickly."
      },
      {
        "title": "Daily Letter Drill",
        "text": "Write each letter 5 times in all its forms. Read one line from the Quran slowly, letter by letter. Track your progress — consistency matters more than speed. Even 10 minutes daily will show results within weeks."
      }
    ]
  },
  {
    "title": "Tajweed Basics",
    "description": "Tajweed (تجويد) means 'to make better or beautify'. It is the science of reciting the Quran with proper pronunciation. Learning it is Fard Kifayah — obligatory for the community.",
    "steps": [
      {
        "title": "Makharij — Points of Articulation",
        "text": "Every Arabic letter emerges from a specific point in the mouth or throat. There are 17 articulation points grouped in 5 areas: the throat (halq), tongue (lisan), lips (shafatan), nasal cavity (khayshum), and the chest (jawf). Knowing where each sound originates helps you pronounce it correctly."
      },
      {
        "title": "Madd — Elongation",
        "text": "Madd means to stretch a vowel sound. Natural Madd (Madd Tabi'i) lasts 2 counts. When followed by a hamza or sukun, the madd lengthens to 4 or 6 counts depending on the rule. The 3 madd letters are Alif (ا), Waw (و), and Ya (ي)."
      },
      {
        "title": "Noon and Meem Rules",
        "text": "Noon Sakinah (نْ) and Tanwin have 4 rules: Idhhar (clear), Idgham (merging), Iqlab (conversion to meem), and Ikhfa (hiding). Meem Sakinah has its own 3 rules. These are among the most common rules you will encounter in recitation."
      },
      {
        "title": "Qalqalah — Echo Sound",
        "text": "Qalqalah is a slight echo or bounce applied to 5 specific letters when they appear with sukun: ق ط ب ج د (remember: QaTaBaJaDa). The echo is stronger at the end of a verse than in the middle of a word."
      },
      {
        "title": "Waqf — Pausing Rules",
        "text": "You will see symbols in the Quran indicating where to pause (وقف) or continue. م means you must stop, لا means do not stop, ج means you may pause, and ∴ means it is better to pause. Learning these makes your recitation flow naturally."
      },
      {
        "title": "Practice Approach",
        "text": "Listen to a qualified reciter (Sheikh Al-Husary, Mishary Rashid, or Al-Minshawi are excellent for Tajweed learning). Repeat each ayah after them. Record yourself and compare. Do not rush — one ayah understood deeply is better than a page recited carelessly."
      }
    ]
  },
  {
    "title": "Understanding Meaning",
    "description": "The Quran was revealed to be understood and acted upon. Reflecting on its meaning (tadabbur) is encouraged in the Quran itself: 'Do they not reflect on the Quran?' (4:82)",
    "steps": [
      {
        "title": "Choose a Trustworthy Translation",
        "text": "For English, reliable translations include: Sahih International, Dr. Mustafa Khattab (The Clear Quran), and Muhammad Asad. Avoid overly literal translations that lose meaning. Read the translation alongside the Arabic to connect words to meanings."
      },
      {
        "title": "Use a Tafsir",
        "text": "Tafsir is detailed Quranic commentary by scholars. Ibn Kathir's Tafsir is widely trusted and available in English. For shorter daily reading, Tafsir Al-Sa'di (also translated) is concise and practical. Start with the surah you are memorising or reciting."
      },
      {
        "title": "Understand Context (Asbab Al-Nuzul)",
        "text": "Many ayahs were revealed in response to specific events. Knowing the reason for revelation (Asbab Al-Nuzul) helps you understand the deeper message and how it applies more broadly. This context is included in most tafsir books."
      },
      {
        "title": "Reflect — Tadabbur",
        "text": "After reading an ayah, pause and ask: What does this tell me about Allah? What does this ask of me? How does this apply to my life right now? Ramadan is the perfect time to deepen this practice — even one ayah reflected upon sincerely is transformative."
      },
      {
        "title": "Keep a Quran Journal",
        "text": "Write down one ayah per day that moves you, along with its meaning and your reflection. Over 30 days of Ramadan, you will build a personal connection with 30 verses. This also helps with memorisation and makes the meaning stick."
      }
    ]
  },
  {
    "title": "Daily Practice",
    "description": "Consistency is the key to Quran progress. The Prophet ﷺ said: 'The most beloved deeds to Allah are the most consistent, even if they are few.' (Bukhari)",
    "steps": [
      {
        "title": "Set a Fixed Time",
        "text": "The best times to recite are after Fajr and after Maghrib — these are times of blessing and the mind is clearer. Even 15 minutes daily after Fajr will take you through the entire Quran in a year if you read one page."
      },
      {
        "title": "The 3-Page Ramadan Plan",
        "text": "To complete the Quran in 30 days of Ramadan, recite 1 Juz per day — approximately 20 pages. Break it into: 7 pages after Fajr, 7 after Dhuhr, 6 after Asr/Maghrib. If that is too much, even completing half the Quran in Ramadan is a great achievement."
      },
      {
        "title": "Revise What You Know",
        "text": "Before reading new portions, revise what you have already memorised or read. Revision strengthens retention. A common method: revise the last 5 pages you read, then proceed with 1 new page. Never let previously learned portions go cold."
      },
      {
        "title": "Listen While Reading",
        "text": "Follow along with a reciter while reading the mushaf. This trains your ears to the correct pronunciation and rhythm. Apps like Quran.com or Tarteel allow you to listen and highlight simultaneously. This doubles the benefit — you hear and see at once."
      },
      {
        "title": "Dua Before Reciting",
        "text": "Begin every Quran session with: 'A'udhu billahi min ash-shaytan ir-rajim. Bismillah ir-rahman ir-raheem.' Then make a short personal du'a asking Allah to open your heart to understanding. Starting with intention and du'a transforms recitation from habit to worship."
      }
    ]
  },
  {
    "title": "Memorisation",
    "description": "Hifz (memorising the Quran) is one of the greatest achievements a Muslim can pursue. The Prophet ﷺ said the hafiz will be with the noble righteous scribes on the Day of Judgement.",
    "steps": [
      {
        "title": "Start with Juz Amma",
        "text": "The 30th Juz contains the shortest surahs and is what most Muslims begin with in childhood. Even as an adult, starting here is correct. Surahs Al-Ikhlas, Al-Falaq, An-Nas, Al-Kawthar, and Al-Asr are excellent first targets."
      },
      {
        "title": "The 3-Repetition Method",
        "text": "Read the ayah looking at the text 3 times. Then close the mushaf and recite from memory 3 times. Then combine it with the previous ayah and recite both 3 times. Only move forward once the current ayah is solid. Never rush — depth beats speed."
      },
      {
        "title": "Repeat in Salah",
        "text": "The most powerful revision tool is using newly memorised ayahs in your voluntary and Sunnah prayers. When you recite something in salah, you are standing before Allah — this creates deep emotional and spiritual anchoring that reinforces memory."
      },
      {
        "title": "Morning Review",
        "text": "Revise everything you have memorised every morning before adding anything new. Most people who lose their Quran do so because they stop revising, not because they stop memorising. Revision is more important than new memorisation."
      },
      {
        "title": "Find an Accountability Partner",
        "text": "Recite to someone — a friend, family member, or Quran teacher — at least once a week. Being heard holds you accountable and errors get corrected. Many mosques offer free Quran circles (halaqas) during Ramadan. If possible, find a certified teacher (hafiz) to check your recitation."
      }
    ]
  }
]